let myfriends = ["maya","rahaf","esraa","hala","jana"];

console.log(myfriends.length); // بتحسب عدد العناصر في المصفوفة وفي هاد المثال عددهم 5



myfriends.shift(); // maya بتعمل ازالة لاول عنصر في المصفوفة وبترجعلي قيمته في هاد المثال الناتج حيكون 
console.log(myfriends);//هون طبعت المصفوفة حتى اتأكد انه اول اسم انحذف وفعلا صارو اربع عناصر 



myfriends.unshift("maya"); //عن طريق هاي الميثود بقدر اضيف عناصر على بداية المصفوفة سواء كان عنصر تمت ازالته او عنصر جديد 
console.log(myfriends); //هون طبعت المصفوفة للتأكد من اضافة العنصر الجديد



myfriends.copyWithin(2,1);
// هاي الميثود بعمل نسخ لعنصر مكان عنصر اخر اول رقم بحدد المكان الي بدي انسخ عليه تاني رقم بحدد بداية النسخ وتالت رقم بحدد نهاية النسخ اذا ما حددت نهاية بنسخ لنهاية المصفوفة  
// في هاد المثال رح انسخ على الموقع 2 وبداية النسخ هو الموقع 1 وما في نهاية للنسخ بالتالي رح يجيب القيمة الموجودة في الموقع 1 وما بعدها لنهاية المصفوفة ويحطهم في الموقع 2 مع المحافظة على حجم المصفوفة



delete myfriends[0];//حذف عناصر من المصفوفة مع الحفاظ على حجمها 
console.log(myfriends); // empty طبعتها حتى اشوف شو بحط مكان العنصر المحذوف وطلع 